Virtual-Java/HoodLoader2/avr/boards.txt
#Board selection (only important for burning bootloaders)
HoodLoader2at90usb162.menu.board.uno=HoodLoader2 Uno
HoodLoader2at90usb162.menu.board.uno.bootloader.file=HexFiles/HoodLoader2_0_6_Uno_at90usb162.hex
HoodLoader2at90usb162.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2at90usb162.menu.board.mega2560.bootloader.file=HexFiles/HoodLoader2_0_6_Mega_at90usb162.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2at90usb162.menu.board.dfu=DFU
HoodLoader2at90usb162.menu.board.dfu.bootloader.file=HexFiles/BootloaderDFU_at90usb162.hex
HoodLoader2at90usb162.menu.board.dfu.bootloader.low_fuses=0xEF
HoodLoader2at90usb162.menu.board.dfu.bootloader.high_fuses=0xD9
HoodLoader2at90usb162.menu.board.dfu.bootloader.extended_fuses=0xF4
HoodLoader2at90usb162.menu.board.dfu.bootloader.unlock_bits=0x3F
HoodLoader2at90usb162.menu.board.dfu.bootloader.lock_bits=0x0F


##############################################################


HoodLoader2atmega32u4.name=HoodLoader2 32u4
HoodLoader2atmega32u4.build.core=arduino:arduino
HoodLoader2atmega32u4.bootloader.tool=arduino:avrdude
HoodLoader2atmega32u4.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2atmega32u4.upload.maximum_size=28672
HoodLoader2atmega32u4.upload.maximum_data_size=2560
HoodLoader2atmega32u4.build.mcu=atmega32u4

#general settings for all boards:
HoodLoader2atmega32u4.build.variant=arduino:leonardo
HoodLoader2atmega32u4.build.board=AVR_LEONARDO
HoodLoader2atmega32u4.build.f_cpu=16000000L

#uploading settings
HoodLoader2atmega32u4.upload.speed=57600
HoodLoader2atmega32u4.upload.protocol=avr109
HoodLoader2atmega32u4.upload.disable_flushing=true
HoodLoader2atmega32u4.upload.use_1200bps_touch=true
HoodLoader2atmega32u4.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2atmega32u4.bootloader.low_fuses=0xFF
HoodLoader2atmega32u4.bootloader.high_fuses=0xD8
HoodLoader2atmega32u4.bootloader.extended_fuses=0xCB
HoodLoader2atmega32u4.bootloader.unlock_bits=0x3F
HoodLoader2atmega32u4.bootloader.lock_bits=0x2F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2atmega32u4.build.vid=0x2341
HoodLoader2atmega32u4.build.pid=0x8036
HoodLoader2atmega32u4.build.usb_product="HoodLoader2 32u4"
HoodLoader2atmega32u4.build.usb_manufacturer="NicoHood"
HoodLoader2atmega32u4.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DIO_MCU_RESET_PIN=4


#Board/Bootloader selection
HoodLoader2atmega32u4.menu.board.leo=HoodLoader2 Leonardo
HoodLoader2atmega32u4.menu.board.leo.bootloader.file=HexFiles/HoodLoader2_0_6_Leonardo_atmega32u4.hex
HoodLoader2atmega32u4.menu.board.micro=HoodLoader2 Micro
HoodLoader2atmega32u4.menu.board.micro.bootloader.file=HexFiles/HoodLoader2_0_6_Micro_atmega32u4.hex
HoodLoader2atmega32u4.menu.board.micro.build.variant=arduino:micro
HoodLoader2atmega32u4.menu.board.micro.build.pid=0x8037
HoodLoader2atmega32u4.menu.board.micro.build.board=AVR_MICRO
HoodLoader2atmega32u4.menu.board.dev=HoodLoader2 Dev
HoodLoader2atmega32u4.menu.board.dev.bootloader.file=HoodLoader2/HoodLoader2.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2atmega32u4.menu.board.dfuleo=DFU Leonardo
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.file=HexFiles/BootloaderDFU_atmega32u4_leo.hex
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.low_fuses=0xFF
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.high_fuses=0xD9
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.extended_fuses=0xC4
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.unlock_bits=0x3F
HoodLoader2atmega32u4.menu.board.dfuleo.bootloader.lock_bits=0x0F
HoodLoader2atmega32u4.menu.board.dfumicro=DFU Micro
# Leds are inverted for micro DFU. Its not intended to be used anyways so I wont make it complicated here.
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.file=HexFiles/BootloaderDFU_atmega32u4_leo.hex
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.low_fuses=0xFF
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.high_fuses=0xD9
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.extended_fuses=0xC4
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.unlock_bits=0x3F
HoodLoader2atmega32u4.menu.board.dfumicro.bootloader.lock_bits=0x0F
HoodLoader2atmega32u4.menu.board.dfumicro.build.board=AVR_MICRO


##############################################################


unoHIDBridge.name=HoodLoader2 Uno

unoHIDBridge.upload.tool=arduino:avrdude
unoHIDBridge.upload.protocol=arduino
unoHIDBridge.upload.maximum_size=32256
unoHIDBridge.upload.maximum_data_size=2048
unoHIDBridge.upload.speed=115200
unoHIDBridge.upload.use_1200bps_touch=true
unoHIDBridge.upload.wait_for_upload_port=true

unoHIDBridge.bootloader.tool=arduino:avrdude
unoHIDBridge.bootloader.low_fuses=0xFF
unoHIDBridge.bootloader.high_fuses=0xDE
unoHIDBridge.bootloader.extended_fuses=0x05
unoHIDBridge.bootloader.unlock_bits=0x3F
unoHIDBridge.bootloader.lock_bits=0x0F
unoHIDBridge.bootloader.file=HexFiles/optiboot_atmega328.hex

unoHIDBridge.build.mcu=atmega328p
unoHIDBridge.build.f_cpu=16000000L
unoHIDBridge.build.board=AVR_UNO
unoHIDBridge.build.core=arduino:arduino
unoHIDBridge.build.variant=arduino:standard


##############################################################


unowifiHIDBridge.name=HoodLoader2 WiFi

unowifiHIDBridge.upload.tool=arduino:avrdude
unowifiHIDBridge.upload.protocol=arduino
unowifiHIDBridge.upload.maximum_size=32256
unowifiHIDBridge.upload.maximum_data_size=2048
unowifiHIDBridge.upload.speed=115200
unowifiHIDBridge.upload.use_1200bps_touch=true
unowifiHIDBridge.upload.wait_for_upload_port=true
unowifiHIDBridge.upload.network.endpoint_upload=/pgm/upload
unowifiHIDBridge.upload.network.endpoint_sync=/pgm/sync
unowifiHIDBridge.upload.network.sync_return=204:SYNC
unowifiHIDBridge.upload.network.endpoint_reset=/log/reset
unowifiHIDBridge.upload.network.port=80

unowifiHIDBridge.bootloader.tool=arduino:avrdude
unowifiHIDBridge.bootloader.low_fuses=0xFF
unowifiHIDBridge.bootloader.high_fuses=0xDE
unowifiHIDBridge.bootloader.extended_fuses=0x05
unowifiHIDBridge.bootloader.unlock_bits=0x3F
unowifiHIDBridge.bootloader.lock_bits=0x0F
unowifiHIDBridge.bootloader.file=HexFiles/optiboot_atmega328.hex

unowifiHIDBridge.build.mcu=atmega328p
unowifiHIDBridge.build.f_cpu=16000000L
unowifiHIDBridge.build.board=AVR_UNO_WIFI_DEV_ED
unowifiHIDBridge.build.core=arduino:arduino
unowifiHIDBridge.build.variant=arduino:standard
unowifiHIDBridge.build.build.esp_ch_uart_br=19200
unowifiHIDBridge.build.build.extra_flags=-DESP_CH_UART -DESP_CH_UART_BR={build.esp_ch_uart_br}


