Virtual-Java/HoodLoader2/avr/boards.txt
##############################################################

uno2018HIDBridge.name=HoodLoader2 WiFi2

uno2018HIDBridge.vid.0=0x03eb
uno2018HIDBridge.pid.0=0x2145
uno2018HIDBridge.upload_port.0.vid=0x03eb
uno2018HIDBridge.upload_port.0.pid=0x2145
uno2018HIDBridge.upload_port.1.board=uno2018

uno2018HIDBridge.upload.tool=arduino:avrdude
uno2018HIDBridge.upload.protocol=arduino
uno2018HIDBridge.upload.tool.default=avrdude
## not supported yet
##uno2018HIDBridge.upload.tool.network=arduino_ota
##uno2018HIDBridge.upload.protocol=xplainedmini_updi
uno2018HIDBridge.upload.maximum_size=48640
uno2018HIDBridge.upload.maximum_data_size=6144
uno2018HIDBridge.upload.speed=115200
uno2018HIDBridge.upload.use_1200bps_touch=true
uno2018HIDBridge.upload.wait_for_upload_port=true
##uno2018HIDBridge.upload.extra_params=-Pusb
##uno2018HIDBridge.upload.extra_files="-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i"

uno2018HIDBridge.build.mcu=atmega4809
uno2018HIDBridge.build.f_cpu=16000000L
uno2018HIDBridge.build.board=AVR_UNO_WIFI_REV2
uno2018HIDBridge.build.core=arduino
uno2018HIDBridge.build.variant=uno2018
uno2018HIDBridge.build.text_section_start=.text=0x200
uno2018HIDBridge.build.extra_flags={build.328emulation} -DMILLIS_USE_TIMERB3
#uno2018HIDBridge.build.extra_flags=-B{runtime.tools.atpack.path}/gcc/dev/{build.mcu}

uno2018HIDBridge.bootloader.tool=avrdude
uno2018HIDBridge.bootloader.tool.default=avrdude
uno2018HIDBridge.bootloader.file=atmega4809_uart_bl.hex
uno2018HIDBridge.bootloader.SYSCFG0=0xC9
uno2018HIDBridge.bootloader.BOOTEND=0x02
uno2018HIDBridge.bootloader.OSCCFG=0x01
uno2018HIDBridge.fuses.file=fuses_4809.bin

menu.mode=Registers emulation
uno2018HIDBridge.menu.mode.on=ATMEGA328
uno2018HIDBridge.menu.mode.on.build.328emulation=-DUNO_WIFI_REV2_328MODE
uno2018HIDBridge.menu.mode.off=None (ATMEGA4809)
uno2018HIDBridge.menu.mode.off.build.328emulation=

##############################################################


megaHIDBridge.name=HoodLoader2 Mega 2560

megaHIDBridge.upload.tool=arduino:avrdude
megaHIDBridge.upload.maximum_data_size=8192
megaHIDBridge.upload.protocol=wiring
megaHIDBridge.upload.maximum_size=253952
megaHIDBridge.upload.speed=115200
megaHIDBridge.upload.use_1200bps_touch=true
megaHIDBridge.upload.wait_for_upload_port=true

megaHIDBridge.bootloader.tool=arduino:avrdude
megaHIDBridge.bootloader.low_fuses=0xFF
megaHIDBridge.bootloader.unlock_bits=0x3F
megaHIDBridge.bootloader.lock_bits=0x0F
megaHIDBridge.bootloader.high_fuses=0xD8
megaHIDBridge.bootloader.extended_fuses=0xFD
megaHIDBridge.bootloader.file=HexFiles/stk500boot_v2_mega2560.hex

megaHIDBridge.build.f_cpu=16000000L
megaHIDBridge.build.core=arduino:arduino
megaHIDBridge.build.mcu=atmega2560
megaHIDBridge.build.board=AVR_MEGA2560
megaHIDBridge.build.variant=arduino:mega

